<!DOCTYPE html>
<html lang="ru">
<head>
  <meta charset="UTF-8" />
  <meta name="viewport" content="width=device-width, initial-scale=1.0" />
  <title>Задание 21 — Практика</title>
  <link href="https://fonts.googleapis.com/css2?family=Orbitron:wght@400;700&display=swap" rel="stylesheet">
  <link rel="stylesheet" href="../../assets/style.css" />
</head>
<body>
  <h1>Задание 21 — Практика</h1>
  <nav>
    <a href="../../index.html">На главную</a> |
    <a href="teoria.html">Теория</a>
  </nav>
  <section>
    <h2>Практическое задание</h2>
    <p>
      Игра «Камни»: у игроков есть куча. Петя начинает. За ход можно либо добавить 1 камень, либо удвоить количество камней в куче. Игра заканчивается, когда камней становится ≥ 129; победитель – сделавший последний ход. Пусть в начале было <code>S</code> камней (1 ≤ S ≤ 128). Найдите минимальное значение <code>S</code>, при котором одновременно выполняются: у Вани есть стратегия выигрыша за первый или второй ход (при любых ходах Пети), но у Вани <strong>нет</strong> стратегии гарантированного выигрыша за первый ход.
    </p>

    <h2>Решение на Python</h2>
    <pre><code>def moves(x):
    return [x + 1, x * 2]

def game(s):
    if s >= 129:
        return 'П1'
    if any(game(m) == 'П1' for m in moves(s)):
        return 'В1'
    if all(game(m) == 'В1' for m in moves(s)):
        return 'П2'
    if any(game(m) == 'П2' for m in moves(s)):
        return 'В2'
    return 'Не выиграет'

for s in range(1, 129):
    if game(s) == 'В2':
        if all(game(m) != 'В1' for m in moves(s)):
            print(s)
            break</code></pre>
    <p>
      Этот код ищет минимальное значение <code>S</code>, при котором Ваня выигрывает за первый или второй ход, но не может выиграть сразу первым ходом.
    </p>
  </section>
</body>
</html>