<!DOCTYPE html>
<html lang="ru">
<head>
  <meta charset="UTF-8" />
  <meta name="viewport" content="width=device-width, initial-scale=1.0" />
  <title>Задание 15 — Практика</title>
  <link href="https://fonts.googleapis.com/css2?family=Orbitron:wght@400;700&display=swap" rel="stylesheet">
  <link rel="stylesheet" href="../../assets/style.css" />
</head>
<body>
  <h1>Задание 15 — Практика</h1>
  <nav>
    <a href="../../index.html">На главную</a> |
    <a href="teoria.html">Теория</a>
  </nav>
  <section>
    <h2>Практическое задание</h2>
    <p>Найдите наименьшее целое неотрицательное число <strong>A</strong>, при котором выражение</p>
    <p style="text-align:center;"><em>(x + 2y &lt; A) ∨ (y &gt; x) ∨ (x &gt; 60)</em></p>
    <p>тождественно истинно для всех целых <em>x, y ≥ 0</em>.</p>
    <h2>Решение на Python</h2>
    <pre><code>def is_true_for_all(A):
    for x in range(0, 61):  # при x>60 (x>60) истина, проверяем x<=60
        for y in range(0, x+1):  # при y>x (y>x) истина, проверяем y<=x
            if not ((x + 2*y < A) or (y > x) or (x > 60)):
                return False
    return True

# Поиск минимального A
a = 0
while True:
    if is_true_for_all(a):
        print(a)
        break
    a += 1  # следующий кандидат
</code></pre>
  </section>
</body>
</html>
