<!DOCTYPE html>
<html lang="ru">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Задание 3 — Практика</title>
  <link href="https://fonts.googleapis.com/css2?family=Orbitron:wght@400;700&display=swap" rel="stylesheet">
  <link rel="stylesheet" href="../../assets/style.css">
</head>
<body>
  <h1>Задание 3 — Практика</h1>
  <nav>
    <a href="../../index.html">На главную</a> |
    <a href="teoria.html">Теория</a>
  </nav>
  <section>
    <h2>Практическое задание</h2>
    <p>По каналу связи передаются сообщения, содержащие восемь букв: А, Б, В, Г, Д, Е, Ж, З. Для передачи используется двоичный код, удовлетворяющий условию Фано. Известны кодовые слова для А, Б, В, Г, Д, Е (см. таблицу). Определите минимальное количество двоичных знаков, необходимое для кодирования двух оставшихся букв (Ж, З).</p>
    <h2>Решение на Python</h2>
    <pre><code># Длины кодовых слов для известных букв A, B, V, G, D, E
known_lengths = [2, 3, 3, 3, 4, 4]  # пример: A=00, B=010, V=011, G=100, D=1010, E=1011

# Условие Фано (непрефиксный): должно соблюдаться неравенство Крафта:
# sum(2^{-l_i}) <= 1

# Вычислим остаточную «ёмкость» для двух символов
remaining = 1 - sum(2**(-l) for l in known_lengths)
print(f"Остаточная ёмкость: {remaining}")

# Попробуем найти минимальную сумму длин l1 + l2, таких что 2^{-l1} + 2^{-l2} <= remaining
best = None
for l1 in range(1, 10):
    for l2 in range(1, 10):
        if 2**(-l1) + 2**(-l2) <= remaining:
            total = l1 + l2
            if best is None or total < best[0]:
                best = (total, l1, l2)

print(f"Минимальная сумма длин: {best[0]} (l1={best[1]}, l2={best[2]})")
</code></pre>
  </section>
</body>
</html>
