<!DOCTYPE html>
<html lang="ru">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Задание 5 — Практика</title>
  <link href="https://fonts.googleapis.com/css2?family=Orbitron:wght@400;700&display=swap" rel="stylesheet">
  <link rel="stylesheet" href="../../assets/style.css">
</head>
<body>
  <h1>Задание 5 — Практика</h1>
  <nav>
    <a href="../../index.html">На главную</a> |
    <a href="teoria.html">Теория</a>
  </nav>
  <section>
    <h2>Практическое задание</h2>
    <p>На вход алгоритма подаётся натуральное число <em>N</em>. Алгоритм строит новое число <em>R</em> так:</p>
    <ol>
      <li>Строится двоичная запись <em>N</em>;</li>
      <li>Если <em>N</em> делится на 3, то к двоичной записи слева приписывается «1», а справа – три последних цифры «111»;</li>
      <li>Если <em>N</em> не делится на 3, то остаток от деления на 3 умножается на 3, переводится в двоичную систему и дописывается в конец.</li>
    </ol>
    <p>Полученная строка – это двоичная запись числа <em>R</em>. Укажите минимальное число <em>R&gt;151</em>, которое может получиться в результате выполнения алгоритма.</p>
    <h2>Решение на Python</h2>
    <pre><code>def build_R(N):
    b = bin(N)[2:]
    if N % 3 == 0:
        suffix = b[-3:]
        new_bin = '1' + b + suffix
    else:
        rem = (N % 3) * 3
        suffix = bin(rem)[2:]
        new_bin = b + suffix
    return int(new_bin, 2)

# Ищем минимальное R > 151
min_R = None
for N in range(1, 1000):  # граница поиска достаточно велика
    R = build_R(N)
    if R > 151:
        if min_R is None or R < min_R:
            min_R = R

print(f"Минимальное R > 151: {min_R}")</code></pre>
  </section>
</body>
</html>