<!DOCTYPE html>
<html lang="ru">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Задание 12 — Практика</title>
  <link href="https://fonts.googleapis.com/css2?family=Orbitron:wght@400;700&display=swap" rel="stylesheet">
  <link rel="stylesheet" href="../../assets/style.css">
</head>
<body>
  <h1>Задание 12 — Практика</h1>
  <nav>
    <a href="../../index.html">На главную</a> |
    <a href="teoria.html">Теория</a>
  </nav>
  <section>
    <h2>Практическое задание</h2>
    <p><strong>Исполнитель «Редактор»</strong> преобразует строку цифр командами:</p>
    <ul>
      <li><code>заменить(v,w)</code> – заменить первое слева вхождение подстроки <em>v</em> на <em>w</em>;</li>
      <li><code>нашлось(v)</code> – проверяет наличие подстроки <em>v</em> в строке.</li>
    </ul>
    <p>Дана программа:</p>
    <pre><code>НАЧАЛО
ПОКА нашлось(52) ИЛИ нашлось(2222) ИЛИ нашлось(1122)
  ЕСЛИ нашлось(52)    ТО заменить(52, 11)  КОНЕЦ ЕСЛИ
  ЕСЛИ нашлось(2222) ТО заменить(2222, 5) КОНЕЦ ЕСЛИ
  ЕСЛИ нашлось(1122) ТО заменить(1122, 25) КОНЕЦ ЕСЛИ
КОНЕЦ ПОКА
КОНЕЦ</code></pre>
    <p>На вход поступает строка, начинающаяся с «5», а затем <em>n</em> цифр «2» (3 &lt; n &lt; 10000). Определите наибольшее <em>n</em>, при котором сумма цифр результирующей строки равна 64.</p>
    <h2>Решение на Python</h2>
    <pre><code>def transform(s):
    while '52' in s or '2222' in s or '1122' in s:
        if '52' in s:
            s = s.replace('52', '11', 1)
        if '2222' in s:
            s = s.replace('2222', '5', 1)
        if '1122' in s:
            s = s.replace('1122', '25', 1)
    return s

# Поиск максимального n
def sum_digits(s):
    return sum(int(c) for c in s)

max_n = 0
for n in range(4, 10000):
    inp = '5' + '2' * n
    res = transform(inp)
    if sum_digits(res) == 64:
        max_n = n
print(max_n)  # ответ задачи</code></pre>
  </section>
</body>
</html>
